## Cleaning File for 2018-19 Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
roster_1819 = pd.read_stata('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/00_source_data/1819_sec_1a.dta')
roster_1819.head()

,hhcode,province,region,psu,idc,s1aq02,s1aq03,s1aq04,s1aq05,age,s1aq62,s1aq63,s1aq64,s1aq07,s1aq08,s1aq09,s1aq10,s1aq11
0,1.102100e+09,khyber pakhtunkhwa,urban,11021001,1,brother/sister in law,main provider away for work,male,present,24,0,0,1994,unmarried / never married,NaN,98,55,yes
1,1.102100e+09,khyber pakhtunkhwa,urban,11021001,2,brother/sister in law,main provider away for work,male,present,23,0,0,1995,unmarried / never married,NaN,98,55,yes
2,1.102100e+09,khyber pakhtunkhwa,urban,11021001,51,head,NaN,female,present,28,0,0,1990,currently married,99.0,99,99,yes
3,1.102100e+09,khyber pakhtunkhwa,urban,11021001,52,son/daughter,main provider away for work,female,present,8,0,0,2010,unmarried / never married,NaN,99,51,yes
4,1.102100e+09,khyber pakhtunkhwa,urban,11021001,53,son/daughter,main provider away for work,female,present,7,0,0,2011,unmarried / never married,NaN,99,51,yes

In [3]:
# renaming relevant variables from roster
roster_1819['sex'] = roster_1819['s1aq04']
roster_1819['marital_status'] = roster_1819['s1aq07']
roster_1819.sample(4)

,hhcode,province,region,psu,idc,s1aq02,s1aq03,s1aq04,s1aq05,age,s1aq62,s1aq63,s1aq64,s1aq07,s1aq08,s1aq09,s1aq10,s1aq11,sex,marital_status
79625,2.631101e+09,punjab,rural,26311009,51,head,NaN,female,present,32,0,0,1986,currently married,99.0,98,99,yes,female,currently married
6387,1.161301e+09,khyber pakhtunkhwa,rural,11613005,54,son/daughter,main provider away for work,female,present,0,22,9,2018,unmarried / never married,NaN,99,51,yes,female,unmarried / never married
102978,3.102200e+09,sindh,urban,31022002,1,head,NaN,male,present,56,1,4,1962,currently married,51.0,98,98,yes,male,currently married
41030,2.141401e+09,punjab,rural,21414010,52,son/daughter,main economic provider,female,absent,19,0,0,1999,unmarried / never married,NaN,1,51,yes,female,unmarried / never married

In [4]:
roster_1819.province.value_counts()

punjab                68716
sindh                 39421
khyber pakhtunkhwa    33851
balochistan           18856
8                      8348
7                      6498
Name: province, dtype: int64

In [5]:
B_relevant = roster_1819[['hhcode', 'idc','age', 'sex', 'marital_status']].copy()
B_relevant.sample(5)

              hhcode  idc  age     sex             marital_status
126833  3.421401e+09   55    0  female  unmarried / never married
45331   2.231200e+09   53    9  female  unmarried / never married
33772   1.731400e+09    5   14    male  unmarried / never married
175417  8.302302e+09   54    3    male  unmarried / never married
4058    1.131301e+09   58    0    male  unmarried / never married

In [6]:
data_1819 = pd.read_stata('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/00_source_data/1819_sec_2ab.dta')
data_1819.head()

,hhcode,province,region,psu,idc,s2aq01,s2aq02,s2aq03,s2aq04,s2bq01,...,s2bq18,s2bq19a,s2bq19b,s2bq19c,s2bq19d,s2bq19e,s2bq19f,s2bq19g,s2bq19h,s2bq19i
0,1.102100e+09,khyber pakhtunkhwa,urban,11021001,1,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.102100e+09,khyber pakhtunkhwa,urban,11021001,2,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.102100e+09,khyber pakhtunkhwa,urban,11021001,51,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.102100e+09,khyber pakhtunkhwa,urban,11021001,52,NaN,NaN,NaN,NaN,currently attending school,...,0-2 km,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,23000.0
4,1.102100e+09,khyber pakhtunkhwa,urban,11021001,53,NaN,NaN,NaN,NaN,currently attending school,...,0-2 km,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,18000.0

In [7]:
data_1819.s2bq01.value_counts()

never attended school                  63318
attended school/institution in past    44349
currently attending school             40047
Name: s2bq01, dtype: int64

In [8]:
# Create variable for ever_admitted and currently attending
data_1819['ever_admitted'] = np.where(data_1819.s2bq01 == 'never attended school', 'no', 'yes')
data_1819.ever_admitted.value_counts()
data_1819['currently_enrolled'] = np.where(data_1819.s2bq01 == 'currently attending school', 'yes', 'no')
data_1819.currently_enrolled.value_counts()

no     107667
yes     40047
Name: currently_enrolled, dtype: int64

In [9]:
C_relevant = data_1819[
    [
        "hhcode",
        "idc",
        "ever_admitted",
        "currently_enrolled",
        "region",
        "province"
    ]
].copy()

C_relevant.sample(5)

,hhcode,idc,ever_admitted,currently_enrolled,region,province
44988,2.311100e+09,52,yes,yes,rural,punjab
13479,1.311100e+09,53,no,no,rural,khyber pakhtunkhwa
59484,2.502100e+09,55,yes,yes,urban,punjab
113214,3.381400e+09,52,no,no,rural,sindh
21958,1.421301e+09,2,yes,yes,rural,khyber pakhtunkhwa

In [10]:
# Checking currently enrolled for NA values
C_relevant.currently_enrolled.isna().sum()

0

In [11]:
# MERGE 
years18_19 = pd.merge(B_relevant, C_relevant, on=["hhcode", 'idc'], how='inner', indicator=False)
# Evaluate merge by checking value counts for currently enrolled individuals
years18_19.currently_enrolled.value_counts()

no     107667
yes     40047
Name: currently_enrolled, dtype: int64

In [12]:
years18_19.loc[years18_19.hhcode == 1102100107.0]

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province
39,1.102100e+09,1,37,male,currently married,yes,no,urban,khyber pakhtunkhwa
40,1.102100e+09,51,29,female,currently married,yes,no,urban,khyber pakhtunkhwa
41,1.102100e+09,52,10,female,unmarried / never married,yes,yes,urban,khyber pakhtunkhwa
42,1.102100e+09,53,4,male,unmarried / never married,no,no,urban,khyber pakhtunkhwa
43,1.102100e+09,55,25,female,unmarried / never married,no,no,urban,khyber pakhtunkhwa
44,1.102100e+09,56,57,female,widow / widower,yes,no,urban,khyber pakhtunkhwa

In [13]:
data_1819.loc[data_1819.hhcode == 1102100107]

,hhcode,province,region,psu,idc,s2aq01,s2aq02,s2aq03,s2aq04,s2bq01,...,s2bq19b,s2bq19c,s2bq19d,s2bq19e,s2bq19f,s2bq19g,s2bq19h,s2bq19i,ever_admitted,currently_enrolled
39,1.102100e+09,khyber pakhtunkhwa,urban,11021001,1,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yes,no
40,1.102100e+09,khyber pakhtunkhwa,urban,11021001,51,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yes,no
41,1.102100e+09,khyber pakhtunkhwa,urban,11021001,52,yes,yes,yes,NaN,currently attending school,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,24000.0,yes,yes
42,1.102100e+09,khyber pakhtunkhwa,urban,11021001,53,NaN,NaN,NaN,NaN,never attended school,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no,no
43,1.102100e+09,khyber pakhtunkhwa,urban,11021001,55,no,NaN,no,no,never attended school,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no,no
44,1.102100e+09,khyber pakhtunkhwa,urban,11021001,56,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yes,no

In [14]:
# Select people in school enrollment age (I would say 4-10 years old)
years18_19 = years18_19.loc[(years18_19["age"] >= 4)&(years18_19["age"] <= 10)]

In [15]:
years18_19.province.value_counts()

punjab                12845
sindh                  7992
khyber pakhtunkhwa     7285
balochistan            4317
Name: province, dtype: int64

In [16]:
# Re-spell the names
years18_19['province'].replace('punjab', 'Punjab', inplace = True)
years18_19['province'].replace('khyber pakhtunkhwa', 'KPK', inplace = True)
years18_19['province'].replace('sindh', 'Sindh', inplace = True)
years18_19['province'].replace('balochistan', 'Balochistan', inplace = True)
years18_19.province.value_counts()

Punjab         12845
Sindh           7992
KPK             7285
Balochistan     4317
Name: province, dtype: int64

In [17]:
# Lets see which hh codes we have:
years18_19["hhcode"] = years18_19["hhcode"].astype("str")
years18_19['subprovince code']= years18_19['hhcode'].apply(lambda x: x[0:4])
years18_19["subprovince code"] = years18_19["subprovince code"].astype("int")
years18_19.head()

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province,subprovince code
3,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102
4,1102100101.0,53,7,female,unmarried / never married,yes,yes,urban,KPK,1102
5,1102100101.0,54,5,female,unmarried / never married,no,no,urban,KPK,1102
13,1102100102.0,55,8,male,unmarried / never married,yes,yes,urban,KPK,1102
37,1102100106.0,53,5,female,unmarried / never married,yes,yes,urban,KPK,1102

In [18]:
stratum_1819 = pd.read_csv('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/00_source_data/stratum_1819.csv')
stratum_1819 = stratum_1819[['subprovince', 'subprovince code']]
stratum_1819.sample(2)

    subprovince  subprovince code
2     Lower Dir              1102
134      Astore              7302

In [19]:
# Merge stratum data with edu and sex data
years18_19_ = pd.merge(years18_19, stratum_1819, on=["subprovince code"], how='inner', indicator=True)

# Evaluate merge 
years18_19_._merge.value_counts()

both          52720
left_only         0
right_only        0
Name: _merge, dtype: int64

In [20]:
years18_19_.drop(columns= ['_merge'], inplace = True)
years18_19_.head()

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province,subprovince code,subprovince
0,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Chitral
1,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Upper Dir
2,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Lower Dir
3,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Swat
4,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Shangla

In [21]:
# Add year indicator for 2018
years18_19_['Year'] = 2018

In [22]:
years18_19_.marital_status.value_counts()

unmarried / never married                         52720
0                                                     0
currently married                                     0
widow / widower                                       0
divorced                                              0
separated                                             0
nikkah solemnized but rukhsati not taken place        0
Name: marital_status, dtype: int64

In [23]:
# Recode marital status
years18_19_.marital_status.replace('unmarried / never married', 1, inplace = True)
years18_19_.marital_status.replace('currently married', 2, inplace = True)
years18_19_.marital_status.replace('widow / widower', 3, inplace = True)
years18_19_.marital_status.replace('separated', 4, inplace = True)
years18_19_.marital_status.replace('divorced', 4, inplace = True)
years18_19_.marital_status.replace('nikkah solemnized but rukhsati not taken place', 5, inplace = True)
years18_19_.marital_status.value_counts()

1    52720
0        0
2        0
3        0
4        0
5        0
Name: marital_status, dtype: int64

In [24]:
years18_19_.isna().any()

hhcode                False
idc                   False
age                   False
sex                   False
marital_status        False
ever_admitted         False
currently_enrolled    False
region                False
province              False
subprovince code      False
subprovince           False
Year                  False
dtype: bool

In [25]:
# Save to csv
years18_19_.to_csv('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/10_data_cleaning/clean_preet/years18_19_.csv', index_label='id')

In [26]:
years18_19_[(years18_19_.subprovince == 'Korangi')]

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province,subprovince code,subprovince,Year
36996,3502100301.0,2,10,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
37002,3502100301.0,53,7,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
37008,3502100304.0,52,4,female,1,no,no,urban,Sindh,3502,Korangi,2018
37014,3502100305.0,53,8,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
37020,3502100307.0,52,5,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
...,...,...,...,...,...,...,...,...,...,...,...,...
45480,3502414605.0,53,6,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
45486,3502414607.0,56,6,male,1,no,no,urban,Sindh,3502,Korangi,2018
45492,3502414608.0,54,6,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
45498,3502414608.0,55,4,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
45504,3502414611.0,2,10,male,1,yes,yes,urban,Sindh,3502,Korangi,2018

In [27]:
# PRE-PROCESSING FOR DIFF-IN-DIFF DATA
# convert currently_enrolled from string to integer
years18_19_["currently_enrolled"].replace("yes", 1, inplace=True)
years18_19_["currently_enrolled"].replace("no", 0, inplace=True)

In [28]:
years18_19_.currently_enrolled.dtype

dtype('int64')

In [29]:
#check region for anomalies
# years19_20_.region.value_counts()
# years19_20_["region"].replace(3, "urban", inplace=True)
# aggregate dataset for sample population
df_grp_1 = years18_19_.groupby(["sex","subprovince","region"])["currently_enrolled"].count().reset_index()
# aggregate dataset for enrollment total
df_grp_2 = years18_19_.groupby(["sex","subprovince","region"])["currently_enrolled"].sum().reset_index()
# merge data set
df_grp_merge = pd.merge(df_grp_1, df_grp_2, on=["sex","subprovince","region"], indicator=True)
# check merge
df_grp_merge._merge.value_counts()

both          524
left_only       0
right_only      0
Name: _merge, dtype: int64

In [30]:
df_grp_merge.sample(3)

,sex,subprovince,region,currently_enrolled_x,currently_enrolled_y,_merge
361,female,Khanewal,urban,187,160,both
33,male,Chitral,urban,142,106,both
198,male,Rahim Yar Khan,rural,0,0,both

In [31]:
# Code Cell 2:
# compute enrollment_rate
df_grp_merge["rate_enrollment"] = (
    df_grp_merge["currently_enrolled_y"] / df_grp_merge["currently_enrolled_x"]
)
# rename columns
df_grp_merge = df_grp_merge.rename(
    columns={
        "currently_enrolled_x": "sample_population",
        "currently_enrolled_y": "enrolled_total",
    }
)
# drop "_merge" column
df_grp_merge.drop(["_merge"], axis=1, inplace=True)
df_grp_merge.sample(5)

,sex,subprovince,region,sample_population,enrolled_total,rate_enrollment
282,female,Bhakkar,rural,0,0,NaN
251,male,Umer Kot,urban,52,33,0.634615
229,male,Sujawal,urban,262,169,0.645038
13,male,Bajur,urban,0,0,NaN
94,male,Kech,rural,0,0,NaN

In [32]:
# Check for NAs before saving
df_grp_merge.isna().any()

sex                  False
subprovince          False
region               False
sample_population    False
enrolled_total       False
rate_enrollment       True
dtype: bool

In [33]:
#Code Cell 3:
# save clean difference-in-difference data set
df_grp_merge.to_csv("/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/20_analysis/enrollment_clean/years18_19_merge_diff.csv")